//ASSBLMAP JOB ,,CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
//PROCMAN  JCLLIB ORDER=(DFH510.CICS.SDFHPROC,FRANCK.CICS.SOURCE,
//         FRANCK.CICS.LINK,FRANCK.CICS.LOAD)
//ASSEM    EXEC DFHMAPS,INDEX='DFH510.CICS',
//         MAPLIB='FRANCK.CICS.LOAD',
//         DSCTLIB='FRANCK.CICS.LINK',
//         MAPNAME='MAPPRJ',RMODE=24
//SYSPRINT DD SYSOUT=A
//SYSUT1   DD DSN=FRANCK.CICS.SOURCE(MAPPRJ),DISP=SHR
/*
//
