//CREAFICH JOB ,,MSGLEVEL=(1,1),MSGCLASS=C,CLASS=A,PRTY=4,
//         NOTIFY=&SYSUID
//*====================================================
//* -> DELETE DES FICHIERS : IEFBR14
//*====================================================
//STEPDEL EXEC PGM=IEFBR14
//DEL1 DD DSN=FRANCK.FINANCE.CLIENT,
//           DISP=(OLD,DELETE,DELETE),
//           UNIT=3390
//DEL2 DD DSN=FRANCK.FINANCE.CLIENT.TRIEASC,
//           DISP=(OLD,DELETE,DELETE),
//           UNIT=3390
//*====================================================
//* -> CREATION DU FICHIER DES CLIENTS
//*====================================================
//STEPCOP1 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD *
0001100335CLAUDE LECOQ        20000704F25CADR00007590000056129CR
0004660325CHARLOTTE RAYNAUD   19770501M30CADR00000140000327028CR
0007070430ARTHUR LEMOINE      19900412M05DADR00001130000023152CR
0005630120GUY-LUC VALL E      19900926F20CADR00007960000330512DB
0003840130AGATHE BLANC        19900201M05VADR00002620000125409CR
0004620130NATHALIE RAMOS      19840709F30MADR00007550000333548CR
0004290330JULIEN MILLET-AUBRY 19760319F05DADR00004920000163261DB
0004990435PAULETTE DE GIRARD  19531002F10DADR00005900000491008CR
0001990335MARC VERDIER        19620226M20MADR00009940000265073CR
0006380120SYLVIE LE GIMENEZ   19500720M20MADR00006930000083909DB
0003560130DENIS BOURGEOIS-JACQ19851008F20VADR00001780000131116DB
0009120330ODETTE L V QUE      20010711M10MADR00000150000280068DB
0001690120HORTENSE LE GOFF    19900904M25MADR00007440000309109DB
0001680330SUSAN MEND S-MOULIN 20030416M15MADR00005560000420990CR
0003120440GUY-FRANCK DEVAUX   19831120M20VADR00002960000199832CR
0007700220AUDREY-ANTOINETTE KL19720823M05CADR00007070000365125DB
0001340225GILLES VIDAL        19770608M15CADR00004960000462498CR
0007370320PHILIPPE ALLARD-COST20000101M15DADR00001950000073482DB
0005940140GUY MULLER-CHAUVET  19560527M30CADR00009220000365276DB
0000940320BERTRAND BOUCHER    20020624M30DADR00003190000266772CR
/*
//SYSUT2 DD DSN=FRANCK.FINANCE.CLIENT,
//          DISP=(NEW,CATLG,DELETE),
//          UNIT=SYSDA,DCB=(RECFM=FB,LRECL=80,BLKSIZE=0),
//          SPACE=(TRK,1),VOL=SER=FDDBAS
//SYSIN DD DUMMY
//*============================================================
//* -> CREATION DU FICHIER DE LA LISTE DES CLIENTS TRIER
//*============================================================
//INCL10 EXEC PGM=SORT
//SYSOUT DD SYSOUT=*
//SORTIN DD DSN=FRANCK.FINANCE.CLIENT,DISP=SHR
//SORTOUT DD DSN=FRANCK.FINANCE.CLIENT.TRIEASC,
//           DISP=(NEW,CATLG,DELETE),
//           SPACE=(TRK,1),VOL=SER=FDDBAS,
//           DCB=(LRECL=80,BLKSIZE=800,RECFM=FB,DSORG=PS)
//SYSIN DD *
   SORT FIELDS=(1,6,ZD,A)
//*============================================================
//* -> CREATION DU KSDS DES CLIENTS
//*============================================================
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN  DD *
 /*=============================================*/
 /* -> SUPPRESSION DES FICHIERS                  */
 /*==============================================*/
     DELETE FRANCK.FINANCE.CLIENT.KSDS PURGE ERASE
 /*=============================================*/
 /*-> CREATION DU ESDS DES CLIENTS              */
 /*=============================================*/
    DEFINE CLUSTER (NAME(FRANCK.FINANCE.CLIENT.KSDS) -
           TRACK(1,1)                       -
           VOL(FDDBAS)                      -
           CISZ (4096)                      -
           RECORDSIZE(80,80)                -
           SHAREOPTIONS(1,3)                -
           INDEXED                          -
           KEYS(6,0)                        -
           NOREUSE)                       -
     DATA (NAME(FRANCK.FINANCE.CLIENT.KSDS.DATA)) -
     INDEX (NAME(FRANCK.FINANCE.CLIENT.KSDS.INDEX))
     IF LASTCC=0 THEN -
      REPRO INDATASET (FRANCK.FINANCE.CLIENT.TRIEASC) -
            OUTDATASET (FRANCK.FINANCE.CLIENT.KSDS)
      LISTCAT ALL LEVEL (FRANCK.FINANCE.CLIENT.KSDS)
 /*=============================================*/
 /*-> CREATION DU AIX AVEC POUR CLE ALTERNATIVE */
 /*-> LE CODE REGION                            */
 /*=============================================*/
    DEFINE AIX(NAME(FRANCK.AIX.REGION)      -
            RELATE(FRANCK.FINANCE.CLIENT.KSDS) -
            TRACK(1,1)                       -
            VOL(FDDBAS)                      -
            CISZ(4096)                       -
            RECORDSIZE(80,80)            -
            KEYS(2,6)-
            FREESPACE(10,10)                 -
            REUSE                            -
            UPGRADE                          -
            NONUNIQUEKEY)                    -
       DATA(NAME(FRANCK.AIX.KSDS.DATA)) -
       INDEX(NAME(FRANCK.AIX.KSDS.INDEX))
     DEFINE PATH -
       (NAME(FRANCK.FINANCE.CLIENT.PATH) -
        PATHENTRY (FRANCK.AIX.REGION))
    BLDINDEX      -
       INDATASET (FRANCK.FINANCE.CLIENT.KSDS) -
       OUTDATASET (FRANCK.AIX.REGION)-
       NOSORTCALL
    IF LASTCC=0 THEN -
       LISTCAT ALL ENTRIES(FRANCK.FINANCE.CLIENT.PATH)
       PRINT INDATASET (FRANCK.AIX.REGION) CHAR
/*
//

