MAPPRJ   DFHMSD TYPE=DSECT,                                            X
               MODE=INOUT,                                             X
               LANG=COBOL,                                             X
               MAPATTS=(COLOR,HILIGHT,OUTLINE),                        X
               DSATTS=(COLOR,HILIGHT),                                 X
               STORAGE=AUTO,                                           X
               TIOAPFX=YES
MAP1     DFHMDI SIZE=(01,80),                                          X
               LINE=03,                                                X
               COLUMN=01,                                              X
               CTRL=(PRINT,FREEKB)
         DFHMDF POS=(01,19),                                           X
               LENGTH=20,                                              X
               INITIAL='CHAMP NUM  CLIENT : '
CDECLT   DFHMDF POS=(01,41),                                           X
               ATTRB=(UNPROT,BRT,IC),                                  X
               LENGTH=06,                                              X
               COLOR=GREEN,                                            X
               HILIGHT=REVERSE,                                        X
               CASE=MIXED,                                             X
               INITIAL='------'
         DFHMDF POS=(01,48),                                           X
               LENGTH=1,                                               X
               ATTRB=PROT
MAP2     DFHMDI SIZE=(12,80),                                          X
               LINE=06,                                                X
               COLUMN=01,                                              X
               CTRL=(PRINT,FREEKB)
         DFHMDF POS=(01,09),                                           X
               LENGTH=16,                                              X
               INITIAL='CODE REGION :   '
CODREG   DFHMDF POS=(01,27),                                           X
               ATTRB=(UNPROT,BRT,IC,FSET),                             X
               LENGTH=02,                                              X
               COLOR=BLUE
         DFHMDF POS=(01,39),                                           X
               LENGTH=16,                                              X
               INITIAL='NATURE COMPTE : '
NATCPT   DFHMDF POS=(01,57),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=02,                                              X
               COLOR=BLUE
         DFHMDF POS=(01,60),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(03,09),                                           X
               LENGTH=16,                                              X
               INITIAL='NOM CLIENT :    '
NOMCPT   DFHMDF POS=(03,27),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=10,                                              X
               COLOR=BLUE
         DFHMDF POS=(03,38),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(03,40),                                           X
               LENGTH=16,                                              X
               INITIAL='PRENOM CLIENT : '
PRNCPT   DFHMDF POS=(03,58),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=10,                                              X
               COLOR=BLUE
         DFHMDF POS=(03,69),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(05,09),                                           X
               LENGTH=16,                                              X
               INITIAL='DTE NAISSANCE : '
DTNCPT   DFHMDF POS=(05,27),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=08,                                              X
               COLOR=BLUE
         DFHMDF POS=(05,36),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(05,39),                                           X
               LENGTH=16,                                              X
               INITIAL='SEXE CLIENT :   '
SEXCPT   DFHMDF POS=(05,56),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=01,                                              X
               COLOR=BLUE
         DFHMDF POS=(05,58),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(07,09),                                           X
               LENGTH=16,                                              X
               INITIAL='ACT PROFESSIO : '
APRCPT   DFHMDF POS=(07,27),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=02,                                              X
               COLOR=BLUE
         DFHMDF POS=(07,30),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(07,39),                                           X
               LENGTH=16,                                              X
               INITIAL='SITUATION SOC : '
SOCCPT   DFHMDF POS=(07,56),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=01,                                              X
               COLOR=BLUE
         DFHMDF POS=(07,58),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(09,09),                                           X
               LENGTH=16,                                              X
               INITIAL='ADRESE CLIENT : '
ADRCPT   DFHMDF POS=(09,27),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=10,                                              X
               COLOR=BLUE
         DFHMDF POS=(09,38),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(09,40),                                           X
               LENGTH=16,                                              X
               INITIAL='SOLDE CLIENT :  '
SLDCPT   DFHMDF POS=(09,57),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=10,                                              X
               JUSTIFY=(RIGHT,ZERO),                                   X
               PICIN='9(8)V9(2)',                                      X
               PICOUT='9(10)',                                         X
               COLOR=BLUE
         DFHMDF POS=(09,69),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(11,09),                                           X
               LENGTH=16,                                              X
               INITIAL='POSITION CLT :  '
POSCPT   DFHMDF POS=(11,27),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=02,                                              X
               COLOR=BLUE
         DFHMDF POS=(11,30),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
MAP3     DFHMDI SIZE=(01,80),                                          X
               LINE=19,                                                X
               COLUMN=01,                                              X
               CTRL=(PRINT,FREEKB)
         DFHMDF POS=(01,09),                                           X
               LENGTH=12,                                              X
               INITIAL='MSG INFOS : '
MSGINF   DFHMDF POS=(01,22),                                           X
               ATTRB=(PROT,BRT),                                       X
               LENGTH=30,                                              X
               COLOR=BLUE
FLAGERR  DFHMDF POS=(01,53),                                           X
               ATTRB=(UNPROT,BRT,IC),                                  X
               LENGTH=01,                                              X
               COLOR=BLUE
         DFHMDF POS=(01,55),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
MAPPRJ   DFHMSD TYPE=FINAL
         END
