MAPREG   DFHMSD TYPE=DSECT,                                            X
               MODE=INOUT,                                             X
               LANG=COBOL,                                             X
               MAPATTS=(COLOR,HILIGHT,OUTLINE),                        X
               DSATTS=(COLOR,HILIGHT),                                 X
               STORAGE=AUTO,                                           X
               TIOAPFX=YES
MAP1     DFHMDI SIZE=(01,80),                                          X
               LINE=03,                                                X
               COLUMN=01,                                              X
               CTRL=(PRINT,FREEKB)
         DFHMDF POS=(01,19),                                           X
               LENGTH=20,                                              X
               INITIAL='INSERER LA REGION : '
CODREG   DFHMDF POS=(01,41),                                           X
               ATTRB=(UNPROT,BRT,IC),                                  X
               LENGTH=02,                                              X
               COLOR=GREEN,                                            X
               HILIGHT=REVERSE,                                        X
               CASE=MIXED,                                             X
               INITIAL='--'
         DFHMDF POS=(01,48),                                           X
               LENGTH=1,                                               X
               ATTRB=PROT
MAP2     DFHMDI SIZE=(12,80),                                          X
               LINE=06,                                                X
               COLUMN=01,                                              X
               CTRL=(PRINT,FREEKB)
         DFHMDF POS=(01,09),                                           X
               LENGTH=16,                                              X
               INITIAL='NBRE CLIENT :   '
NBCLIE   DFHMDF POS=(01,27),                                           X
               ATTRB=(UNPROT,BRT,IC,FSET),                             X
               LENGTH=04,                                              X
               JUSTIFY=(RIGHT,ZERO),                                   X
               PICIN='9(4)',                                           X
               PICOUT='9(4)',                                          X
               COLOR=BLUE
         DFHMDF POS=(01,32),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(03,09),                                           X
               LENGTH=16,                                              X
               INITIAL='NB CLIENT DB :  '
NCLIDB   DFHMDF POS=(03,27),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=04,                                              X
               JUSTIFY=(RIGHT,ZERO),                                   X
               PICIN='9(4)',                                           X
               PICOUT='9(4)',                                          X
               COLOR=BLUE
         DFHMDF POS=(03,32),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(05,09),                                           X
               LENGTH=16,                                              X
               INITIAL='MONT CLIENT CR :'
MCLIDB   DFHMDF POS=(05,27),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=10,                                              X
               JUSTIFY=(RIGHT,ZERO),                                   X
               PICIN='9(8)V9(2)',                                      X
               PICOUT='9(10)',                                         X
               COLOR=BLUE
         DFHMDF POS=(05,38),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(07,09),                                           X
               LENGTH=16,                                              X
               INITIAL='NB CLIENT CR :  '
NCLICR   DFHMDF POS=(07,27),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=04,                                              X
               JUSTIFY=(RIGHT,ZERO),                                   X
               PICIN='9(4)',                                           X
               PICOUT='9(4)',                                          X
               COLOR=BLUE
         DFHMDF POS=(07,32),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
         DFHMDF POS=(09,09),                                           X
               LENGTH=16,                                              X
               INITIAL='MONT CLIENT CR :'
MCLICR   DFHMDF POS=(09,27),                                           X
               ATTRB=(UNPROT,BRT,FSET),                                X
               LENGTH=10,                                              X
               JUSTIFY=(RIGHT,ZERO),                                   X
               PICIN='9(8)V9(2)',                                      X
               PICOUT='9(10)',                                         X
               COLOR=BLUE
         DFHMDF POS=(09,38),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
MAP3     DFHMDI SIZE=(01,80),                                          X
               LINE=19,                                                X
               COLUMN=01,                                              X
               CTRL=(PRINT,FREEKB)
         DFHMDF POS=(01,09),                                           X
               LENGTH=12,                                              X
               INITIAL='MSG INFOS : '
MSGINF   DFHMDF POS=(01,22),                                           X
               ATTRB=(PROT,BRT),                                       X
               LENGTH=30,                                              X
               COLOR=BLUE
FLAGERR  DFHMDF POS=(01,53),                                           X
               ATTRB=(UNPROT,BRT,IC),                                  X
               LENGTH=01,                                              X
               COLOR=BLUE
         DFHMDF POS=(01,55),                                           X
               ATTRB=PROT,                                             X
               LENGTH=01
MAPREG   DFHMSD TYPE=FINAL
         END
